---
kind: method
id: M:Autodesk.Revit.DB.Element.Dispose
zh: 构件、图元、元素
source: html/e3b07ee4-f500-1b95-c786-8984289a5143.htm
---
# Autodesk.Revit.DB.Element.Dispose Method

**中文**: 构件、图元、元素

Releases all resources used by the Element

## Syntax (C#)
```csharp
public void Dispose()
```